:PROPERTIES:
:GPTEL_MODEL: gpt-3.5-turbo
:GPTEL_BOUNDS: ((2389 . 2694) (2853 . 3963) (4069 . 5009) (5283 . 6669))
:END:
#+TITLE: Cecilia's website
#+SUBTITLE: Proyecto de portafolio diseñador UX
#+AUTHOR: Sebastian Godoy Olivares
#+EMAIL: shackleto@riseup.net
#+DATE: 
#+DESCRIPTION: Desarrollo de personal website utilizando jekyll  
#+KEYWORDS: ruby, rails, jekyll
#+LANGUAGE: es
#+OPTIONS: toc:nil num:nil
#+CATEGORY: desarrollos
#+TAGS: UX, docker, docker-compose, jekyll


* Descripcion:
El siguiente proyecto corresponde a un  desarrollo web, utilizando el framework Jekyll, se utiliza un template libre.
y voy a contenerizar la aplicacion y configurarla como servicio, para ser gestionada un cualquier docker-host.
#+begin_src bash
ls -l
#+end_src

#+RESULTS:
| total      | 168 |            |            |        |     |    |       |              |
| -rwxr-xr-x |   1 | shackleton | shackleton |    286 | abr | 11 |  2022 | 404.html     |
| -rwxr-xr-x |   1 | shackleton | shackleton |    567 | abr | 11 |  2022 | _config.yml  |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _data        |
| -rwxr-xr-x |   1 | shackleton | shackleton | 100251 | abr | 11 |  2022 | favicon.ico  |
| -rwxr-xr-x |   1 | shackleton | shackleton |    120 | abr | 11 |  2022 | Gemfile      |
| -rw-r--r-- |   1 | shackleton | shackleton |   1936 | ago |  2 | 14:17 | Gemfile.lock |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | images       |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _includes    |
| -rwxr-xr-x |   1 | shackleton | shackleton |    457 | abr | 11 |  2022 | index.html   |
| drwxr-xr-x |   3 | shackleton | shackleton |   4096 | abr | 11 |  2022 | js           |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _layouts     |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _pages       |
| drwxr-xr-x |   2 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _posts       |
| -rw-r--r-- |   1 | shackleton | shackleton |   4951 | abr | 11 |  2022 | README.md    |
| drwxr-xr-x |   7 | shackleton | shackleton |   4096 | abr | 11 |  2022 | _sass        |
| -rwxr-xr-x |   1 | shackleton | shackleton |    393 | abr | 11 |  2022 | search.json  |
| drwxr-xr-x |   9 | shackleton | shackleton |   4096 | ago |  2 | 14:20 | _site        |

This is Cecilia's website project, a portfolio design project for a UX designer. The project utilizes the Jekyll framework and a free template. The application will be containerized and configured as a service to be managed on any Docker host. The file listing shows the contents of the project directory.

